In [17]:
import csv
import pandas as pd

In [18]:
country_data = '/home/dipp/Github/Master-Thesis-dipp/Country Data Extraction/Version 2/Location_with_only_country_code_V2_Latest.csv'
result = '/home/dipp/Github/Master-Thesis-dipp/Country Data Extraction/Version 2/country_stat.csv'

In [19]:
source_country_dict = {}
destination_country_dict = {}
total_tweet = 0
source_count = 0
destination_count = 0

In [20]:
with open(country_data, 'r') as cd:
    raw_data = csv.DictReader(cd)

    for line in raw_data:
        if(line['i'] != 'None' and line['j']!= 'None'):
            source = line['i'].replace("'",'')
            destination = line['j'].replace("'",'')
            tweets = int(float(line['count']))
            total_tweet += tweets


            source_count = source_country_dict.get(source)
            destination_count = destination_country_dict.get(destination)

            if(source_count != None):
                source_country_dict[source] = tweets + source_count

            if(source_count == None):
                source_country_dict[source] = tweets
            
            if(destination_count != None):
                destination_country_dict[destination] = tweets + destination_count

            if(destination_count == None):
                destination_country_dict[destination] = tweets


            source_count = 0
            destination_count = 0

In [21]:
total_tweet

68083616

In [22]:
source_df = pd.DataFrame(list(source_country_dict.items()), columns=['country', 'number of tweets'])
destination_df = pd.DataFrame(list(destination_country_dict.items()), columns=['country', 'number of tweets'])

source_df = source_df.sort_values(by=['number of tweets'], ascending=False)
destination_df = destination_df.sort_values(by=['number of tweets'], ascending=False)

In [23]:
source_df

    country  number of tweets
1        US          40976630
3        IN           5880670
2        GB           5616121
0        CA           2098929
25       CO           1553302
..      ...               ...
212      BZ                 4
209      SC                 4
216      TD                 2
220      ME                 2
219      GA                 1

[221 rows x 2 columns]

In [24]:
destination_df

    country  number of tweets
2        US          39088826
4        IN           5801046
13       GB           5465170
0        CA           2668498
22       CO           1582828
..      ...               ...
206      MH                 3
221      GA                 3
218      SM                 2
222      FK                 1
223      CX                 1

[224 rows x 2 columns]